### **Data Input and Output**
- CSV
- Excel

In [2]:
import pandas as pd

In [10]:
pwd             # to check the location of the notebook

'f:\\Machine Learning - All Materials and Courses\\Udemy\\Python for Data Science and Machine Learning Bootcamp\\Programs\\Pandas'

In [4]:
df = pd.read_csv(r"F:\Machine Learning - All Materials and Courses\Udemy\Python for Data Science and Machine Learning Bootcamp\Refactored_Py_DS_ML_Bootcamp-master\03-Python-for-Data-Analysis-Pandas\example")

In [5]:
df.to_csv('My_output.csv', index=False)

In [6]:
pd.read_excel(r"F:\Machine Learning - All Materials and Courses\Udemy\Python for Data Science and Machine Learning Bootcamp\Refactored_Py_DS_ML_Bootcamp-master\03-Python-for-Data-Analysis-Pandas\Excel_Sample.xlsx",
              sheet_name='Sheet1', index_col=0)

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [16]:
data = pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/')

In [17]:
data[0]

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Republic First Bank dba Republic Bank,Philadelphia,PA,27332,"Fulton Bank, National Association","April 26, 2024",10546
1,Citizens Bank,Sac City,IA,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
2,Heartland Tri-State Bank,Elkhart,KS,25851,"Dream First Bank, N.A.","July 28, 2023",10544
3,First Republic Bank,San Francisco,CA,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
4,Signature Bank,New York,NY,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
...,...,...,...,...,...,...,...
564,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001",6004
565,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001",4648
566,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001",4647
567,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000",4646
568,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000",4645

In [20]:
# creating a small and temporary sqlite engine database
from sqlalchemy import create_engine
engine = create_engine('sqlite:///:memory:')

In [21]:
df.to_sql('my_table', engine)

4

In [27]:
sqldf = pd.read_sql('my_table', con=engine, index_col=0)

In [30]:
sqldf

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15